# Books (core)

## Part 1: Design an ERD
**Create an ERD to represent a database that tracks users and their favorite books.**

![png](books_erd.png)

## Part 2: Generate Forward Engineering Script
[see SQL file](create_books_database.sql)

## Part 3: Insert data into the database with Python

In [2]:
# Connect to the Database with Sqlalchemy+Pandas
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [3]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [5]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

### loading data in authos table)

In [10]:
# Read in the authors data and preview
authors = pd.read_csv('Data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
# using DESCRIBE to compare the SQL table against our DataFrame
q =''' DESCRIBE authors ; '''
describe = pd.read_sql(q,conn)
describe

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

 we confirm that our DataFrame to match the table in our SQL database

In [13]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [14]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [15]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,conn)

   @@FOREIGN_KEY_CHECKS
0                     0

In [16]:
# Inserting Data into the authors Table
authors.to_sql("authors",conn,index=False, if_exists='append')

5

In [17]:
# confirm the authors data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [18]:
# check the describe again to confirm no changes
q = """DESCRIBE authors;"""
pd.read_sql(q,conn)

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

### loadind data in books table

In [20]:
# Read in the authors data and preview
books = pd.read_csv('Data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [21]:
# using DESCRIBE to compare the SQL table against our DataFrame
q =''' DESCRIBE books ; '''
describe_books = pd.read_sql(q,conn)
describe_books

       Field         Type Null  Key Default           Extra
0         id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

 we confirm that our DataFrame to match the table in our SQL database

In [22]:
# Inserting Data into the books Table
books.to_sql("books",conn,index=False, if_exists='append')

6

In [23]:
# confirm the books data has been added
q = """SELECT * FROM books;"""
pd.read_sql(q,conn)

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [24]:
# check the describe again to confirm no changes
q = """DESCRIBE books;"""
pd.read_sql(q,conn)

       Field         Type Null  Key Default           Extra
0         id          int   NO  PRI    None  auto_increment
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

### loading data in the users table

In [26]:
# Read in the users data and preview
users = pd.read_csv('Data/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [27]:
# using DESCRIBE to compare the SQL table against our DataFrame
q =''' DESCRIBE users ; '''
describe_users = pd.read_sql(q,conn)
describe_users

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

 we confirm that our DataFrame to match the table in our SQL database

In [28]:
# Inserting Data into the users Table
users.to_sql("users",conn,index=False, if_exists='append')

3

In [29]:
# confirm the users data has been added
q = """SELECT * FROM users;"""
pd.read_sql(q,conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [30]:
# check the describe again to confirm no changes
q = """DESCRIBE users;"""
pd.read_sql(q,conn)

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

### loading data in the favorites table

In [31]:
# Read in the favorites data and preview
favorites = pd.read_csv('Data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [32]:
# using DESCRIBE to compare the SQL table against our DataFrame
q =''' DESCRIBE favorites ; '''
describe_favorites = pd.read_sql(q,conn)
describe_favorites

     Field Type Null  Key Default Extra
0  user_id  int   NO  MUL    None
1  book_id  int   NO  MUL    None

we confirm that our DataFrame to match the table in our SQL database

In [33]:
# Inserting Data into the favorites Table
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [34]:
# confirm the favorites data has been added
q = """SELECT * FROM favorites;"""
pd.read_sql(q,conn)

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

In [35]:
# check the describe again to confirm no changes
q = """DESCRIBE favorites;"""
pd.read_sql(q,conn)

     Field Type Null  Key Default Extra
0  user_id  int   NO  MUL    None
1  book_id  int   NO  MUL    None

In [36]:
# Closing the connection
conn.close()
# Deleting the engine and connection
del engine, conn

## Part 4: Testing the Database

In [4]:
# Creating new engine and connection
engine = create_engine(connection)
conn = engine.connect()

In [5]:
# check if the value for foreign key checks has reset
pd.read_sql('SELECT @@FOREIGN_KEY_CHECKS',conn)

   @@FOREIGN_KEY_CHECKS
0                     1

In [7]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [10]:
# Testing the database : writting a query to list the titles of all of John Doe's favorite books.
q = ''' SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.first_name = "John" AND users.last_name = "Doe")); '''
pd.read_sql(q, conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

In [11]:
# Closing the connection
conn.close()